; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 182)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 183)
	(= (data Star5 image1) 45)
	(= (data Phenomenon6 image1) 183)
	(= (data Phenomenon7 image1) 240)
	(= (data Star8 image1) 3)
	(= (data Star5 infrared2) 271)
	(= (data Phenomenon6 infrared2) 74)
	(= (data Phenomenon7 infrared2) 239)
	(= (data Star8 infrared2) 126)
	(= (data Star5 spectrograph0) 16)
	(= (data Phenomenon6 spectrograph0) 117)
	(= (data Phenomenon7 spectrograph0) 229)
	(= (data Star8 spectrograph0) 226)
	(= (data Star5 infrared3) 196)
	(= (data Phenomenon6 infrared3) 175)
	(= (data Phenomenon7 infrared3) 6)
	(= (data Star8 infrared3) 71)
	(= (slew_time GroundStation1 Star0) 36.41)
	(= (slew_time Star0 GroundStation1) 36.41)
	(= (slew_time GroundStation4 Star0) 24.87)
	(= (slew_time Star0 GroundStation4) 24.87)
	(= (slew_time GroundStation4 GroundStation1) 3.979)
	(= (slew_time GroundStation1 GroundStation4) 3.979)
	(= (slew_time GroundStation4 Star2) 21.41)
	(= (slew_time Star2 GroundStation4) 21.41)
	(= (slew_time GroundStation4 GroundStation3) 32.73)
	(= (slew_time GroundStation3 GroundStation4) 32.73)
	(= (slew_time Star2 Star0) 67.15)
	(= (slew_time Star0 Star2) 67.15)
	(= (slew_time Star2 GroundStation1) 65.01)
	(= (slew_time GroundStation1 Star2) 65.01)
	(= (slew_time GroundStation3 Star0) 0.3706)
	(= (slew_time Star0 GroundStation3) 0.3706)
	(= (slew_time GroundStation3 GroundStation1) 8.112)
	(= (slew_time GroundStation1 GroundStation3) 8.112)
	(= (slew_time GroundStation3 Star2) 39.4)
	(= (slew_time Star2 GroundStation3) 39.4)
	(= (slew_time Star5 Star0) 40.59)
	(= (slew_time Star0 Star5) 40.59)
	(= (slew_time Star5 GroundStation1) 38.92)
	(= (slew_time GroundStation1 Star5) 38.92)
	(= (slew_time Star5 Star2) 22.79)
	(= (slew_time Star2 Star5) 22.79)
	(= (slew_time Star5 GroundStation3) 73.07)
	(= (slew_time GroundStation3 Star5) 73.07)
	(= (slew_time Star5 GroundStation4) 63.98)
	(= (slew_time GroundStation4 Star5) 63.98)
	(= (slew_time Phenomenon6 Star0) 10.9)
	(= (slew_time Star0 Phenomenon6) 10.9)
	(= (slew_time Phenomenon6 GroundStation1) 40.49)
	(= (slew_time GroundStation1 Phenomenon6) 40.49)
	(= (slew_time Phenomenon6 Star2) 10.95)
	(= (slew_time Star2 Phenomenon6) 10.95)
	(= (slew_time Phenomenon6 GroundStation3) 63.63)
	(= (slew_time GroundStation3 Phenomenon6) 63.63)
	(= (slew_time Phenomenon6 GroundStation4) 80.86)
	(= (slew_time GroundStation4 Phenomenon6) 80.86)
	(= (slew_time Phenomenon6 Star5) 19.93)
	(= (slew_time Star5 Phenomenon6) 19.93)
	(= (slew_time Phenomenon7 Star0) 49.79)
	(= (slew_time Star0 Phenomenon7) 49.79)
	(= (slew_time Phenomenon7 GroundStation1) 4.996)
	(= (slew_time GroundStation1 Phenomenon7) 4.996)
	(= (slew_time Phenomenon7 Star2) 69.11)
	(= (slew_time Star2 Phenomenon7) 69.11)
	(= (slew_time Phenomenon7 GroundStation3) 5.659)
	(= (slew_time GroundStation3 Phenomenon7) 5.659)
	(= (slew_time Phenomenon7 GroundStation4) 55.02)
	(= (slew_time GroundStation4 Phenomenon7) 55.02)
	(= (slew_time Phenomenon7 Star5) 42.39)
	(= (slew_time Star5 Phenomenon7) 42.39)
	(= (slew_time Phenomenon7 Phenomenon6) 5.372)
	(= (slew_time Phenomenon6 Phenomenon7) 5.372)
	(= (slew_time Star8 Star0) 12.88)
	(= (slew_time Star0 Star8) 12.88)
	(= (slew_time Star8 GroundStation1) 2.789)
	(= (slew_time GroundStation1 Star8) 2.789)
	(= (slew_time Star8 Star2) 18)
	(= (slew_time Star2 Star8) 18)
	(= (slew_time Star8 GroundStation3) 17.75)
	(= (slew_time GroundStation3 Star8) 17.75)
	(= (slew_time Star8 GroundStation4) 20.09)
	(= (slew_time GroundStation4 Star8) 20.09)
	(= (slew_time Star8 Star5) 15.08)
	(= (slew_time Star5 Star8) 15.08)
	(= (slew_time Star8 Phenomenon6) 28.3)
	(= (slew_time Phenomenon6 Star8) 28.3)
	(= (slew_time Star8 Phenomenon7) 4.902)
	(= (slew_time Phenomenon7 Star8) 4.902)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star2)
	(have_image Star5 spectrograph0)
	(have_image Phenomenon6 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 spectrograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 182 to 171.05, (fuel-used) from 0 to 10.95
   goals met: 1 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 6
4. (turn_to satellite1 phenomenon6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 183 to 119.37, (fuel-used) from 10.95 to 74.58
   goals met: 1 of 6
5. (take_image satellite1 phenomenon6 instrument2 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 883, (data-stored) from 0 to 117
   goals met: 2 of 6
6. (turn_to satellite1 phenomenon7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 119.37 to 113.998, (fuel-used) from 74.58 to 79.952
   goals met: 2 of 6
7. (take_image satellite1 phenomenon7 instrument2 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   changed: (data_capacity satellite1) from 883 to 654, (data-stored) from 117 to 346
   goals met: 3 of 6
8. (turn_to satellite1 star8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 113.998 to 109.096, (fuel-used) from 79.952 to 84.854
   goals met: 3 of 6
9. (take_image satellite1 star8 instrument2 spectrograph0)
   added: (have_image star8 spectrograph0)
   changed: (data_capacity satellite1) from 654 to 428, (data-stored) from 346 to 572
   goals met: 4 of 6
10. (turn_to satellite1 star5 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 109.096 to 94.016, (fuel-used) from 84.854 to 99.934
   goals met: 4 of 6
11. (take_image satellite1 star5 instrument2 spectrograph0)
   added: (have_image star5 spectrograph0)
   changed: (data_capacity satellite1) from 428 to 412, (data-stored) from 572 to 588
   goals met: 5 of 6
12. (turn_to satellite1 star2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 94.016 to 71.226, (fuel-used) from 99.934 to 122.724
   goals met: 6 of 6
